app/controllers/api/bills_controller.rb

  def create

    # Ajax request for bill pay form
    # $.ajax({url:'/api/bills', method:'POST', data: {bills:
    #   { amount: 30,
    #     recipients: [13, 14],
    #     description: "Dinner",
    #     bill_date: "2016-12-01"
    #   }}})
    split = bill_params[:amount].to_f / (bill_params[:recipients].length + 1)
    puts bill_params[:recipients]
    @bill = Bill.new(amount: bill_params[:amount].to_i,
                     description: bill_params[:description],
                     bill_date: bill_params[:bill_date],
                     author_id: current_user.id,
                     split: bill_params[:recipients].length + 1,
                    )
    if @bill.save
      # Create billsplits for each recipient_id
      bill_params[:recipients].each do |id|
        Billsplit.create(bill_id: @bill.id, recipient_id: id.to_i, split_amount: split.round(2) )
---
INSERT INTO "bills" ("amount", "description", "bill_date", "author_id", "split", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "billsplits" ("bill_id", "recipient_id", "split_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bill_id", 11], ["recipient_id", 16], ["split_amount", 200.0], ["created_at", "2021-12-21 19:22:51.895983"], ["updated_at", "2021-12-21 19:22:51.895983"]]

    end

    if paid_billsplit_ids.length > 0
      Billsplit.where(id: paid_billsplit_ids).update_all(recipient_paid: true, split_amount: 0)
---
SELECT "billsplits".* FROM "billsplits" WHERE "billsplits"."bill_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
UPDATE "bills" SET "paid" = 't' WHERE "bills"."id" IN (5, 11)
UPDATE "billsplits" SET "recipient_paid" = 't', "split_amount" = 0.0 WHERE "billsplits"."id" = 17

    # Updating paid column for bills after billsplits have been updated
    bill_paid_info = current_user.bill_paid

    Bill.where(id: bill_paid_info).update_all(paid: true)
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" IN (20)